{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.2", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_3", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_4", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_4", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_5", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_5", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_6", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_6", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_7", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_7", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_8", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_8", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_9", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_9", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_10", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_10", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_11", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 16, "padding": "same"}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_11", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_12", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_12", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_13", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "name": "conv2d_14", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_14", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_13", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["conv2d_14", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_15", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_15", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_14", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_16", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_16", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_15", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_17", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_17", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_16", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_18", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_18", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_17", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_19", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_19", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_18", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_20", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_20", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_19", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "name": "add_9", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_21", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_21", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_20", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_22", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 32, "padding": "same"}, "name": "conv2d_22", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_21", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "name": "add_10", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_23", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_23", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_22", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_24", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_24", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "name": "conv2d_25", "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_25", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_23", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_11"}, "name": "add_11", "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_26", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_26", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_24", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_27", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_27", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_25", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_12"}, "name": "add_12", "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_28", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_28", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_26", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_29", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_29", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_27", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_13"}, "name": "add_13", "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "name": "activation_27", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_30", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_30", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_28", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_31", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_31", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_29", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_14"}, "name": "add_14", "inbound_nodes": [[["activation_27", 0, 0, {}], ["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "name": "activation_29", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2d_32", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "filters": 64, "padding": "same"}, "name": "conv2d_32", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_30", "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_32", 0, 0, 