{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 32, 32, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_7", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_8", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_10", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_11", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_12", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_13", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_14", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_15", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_16", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_17", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_17", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_18", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_19", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_19", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_20", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_21", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "name": "add_10", "config": {"trainable": true, "name": "add_10"}}, {"class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "activation_21", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_22", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_23", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_21", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]], "name": "add_11", "config": {"trainable": true, "name": "add_11"}}, {"class_name": "Activation", "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "activation_23", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_24", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_25", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]], "name": "add_12", "config": {"trainable": true, "name": "add_12"}}, {"class_name": "Activation", "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "activation_25", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "conv2d_26", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_26", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_27", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_27", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]], "name": "add_13", "config": {"trainable": true, "name": "add_13"}}, {"class_name": "Activation", "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "activation_27", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv2d_28", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_28", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_29", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": [[["activation_27", 0, 0, {}], ["batch_normalization_29", 0, 0, {}]]], "name": "add_14", "config": {"trainable": true, "name": "add_14"}}, {"class_name": "Activation", "inbound_nodes": [[["add_14", 0, 0, {}]]], "name": "activation_29", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_30", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "name": "conv2d_31", "config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "normal", "mode": "fan_in", "scale": 2.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_31", "activity_regularizer": null, "strides": [1, 1], "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "name": "batch_normalization_31", "config": {"trainable": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_31", "epsilon": 0.001, "center": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Add", "inbound_nodes": 